{
    "headline": "I build things on the internet.",
    "skills": "Skills",
    "aboutMeSection": "About Me",
    "experiences": "Experiences",
    "projects": "Projects",
    "contact": {
        "title": "Contact",
        "description": "Thank you for visiting my portfolio! I am currently employed full-time as a middle front-end developer for <a href='https://redoc.co/' target='_blank' rel='noopener noreferrer' class='link-primary'>Redoc.co</a>, but I am always open to new opportunities and challenges. <br><br>If you have an exciting project or part-time opportunity related to my field, I would love to hear from you. I am passionate about expanding my skill set and contributing to valuable projects. Feel free to reach out and let's discuss how we can collaborate to create something great together!",
        "address-1": "District 8, Ho Chi Minh City",
        "address-2": "Ninh Kieu District, Can Tho City"
    },
    "contact-form": {
        "name": {
            "label": "Name",
            "placeholder": "Enter your name",
            "required": "Please enter your name!"
        },
        "email": {
            "label": "Email",
            "placeholder": "Enter your email",
            "required": "Please enter your email!",
            "invalid": "Please enter a valid email!"
        },
        "company": {
            "label": "Company (Optional)",
            "placeholder": "Enter your company",
            "required": "Please enter your company!"
        },
        "message": {
            "label": "Message",
            "placeholder": "Enter your message",
            "required": "Please enter your message!"
        }
    },
    "menu": {
        "about": "About",
        "experience": "Experience",
        "skills": "Skills",
        "projects": "Projects",
        "contact": "Contact"
    },
    "credential": {
        "label": {
            "name": "Name",
            "age": "Age",
            "email": "Email",
            "location": "Location",
            "language": "Language",
            "education": "Education"
        },
        "value": {
            "name": "Tran Duc Phuong",
            "age": "24",
            "email": "tdp99.business@gmail.com",
            "location": "Can Tho, HCM City (VN)",
            "language": "Vietnamese, English",
            "education": "Bachelor of Engineer (Valedictorian) - Can Tho University"
        }
    },
    "yoe": "Years of Experience",
    "statData": {
        "yoe": "Years of Experience",
        "projects": "Projects Completed"
    },
    "contact-info": "Contact Info",
    "to-contact-info": "To Contact Info",
    "skillType": {
        "technical": {
            "label": "Technical",
            "angular": {
                "description": "I have been primarily using Angular as the main frontend framework for both corporate and personal projects. Over the past 1.5 years, it's safe to say that almost every week I have either been coding with Angular or deepening my understanding of it.",
                "subSkills": {
                    "1": "Implementing Basic & Reusable Building Block: Components, Directives, Pipes, etc ",
                    "2": "Form Manipulation: Reactive Forms, Template Driven Forms",
                    "3": "Dependency Injection Apply in Practice",
                    "4": "Routing & Navigation",
                    "5": "Handle HTTP Request (RESTful API) with HttpClient",
                    "6": "Understanding Data Sharing Between Components Using Binding, Service, DI and Store (NgRx)"
                }
            },
            "js": {
                "description": "",
                "subSkills": {
                    "1": "DOM Manipulation",
                    "2": "Interface, Type Alias and Enum",
                    "3": "Using Generics",
                    "4": "Creating and Using Custom Decorators"
                }
            }
        },
        "tool": {
            "label": "Tools & Technologies"
        },
        "soft": {
            "label": "Additional Skills",
            "english": {
                "shortDescription": "TOEIC 970, Good Conversational English",
                "description": "For over two years, I have been utilizing English as my primary working language. I am comfortable communicating in English, both in written and spoken form, and I have a good grasp of reading and understanding English documents"
            },
            "agile": {
                "shortDescription": "As a Member",
                "description": "I have been working in an Agile environment for over two years. I am familiar with the Scrum framework and have been using it in my daily work. I also have a good understanding of Kanban and have used it in some of my projects."
            }
        }
    },
    "haveSolidUnderstandingOf": "Have A Solid Understanding Of",
    "certificates": "Certificates",
    "libraryUsed": "Library Used",
    "sendMessage": "Send Message",
    "resume": "Resume",
    "aboutMe": "Hello there! My name is Tran Duc Phuong, and I am an Angular front-end developer based in the beautiful cities of Can Tho and Ho Chi Minh City, Vietnam. I am truly humbled by the opportunity to work in this field, and my main goal is to contribute valuable and meaningful work to the industry. I am constantly striving to learn and grow, and I am excited to collaborate and create impactful digital experiences. Let's embark on this journey together and make a difference!",
    "p404": {
        "title": "Ooops... 404!",
        "description": "The page you requested could not be found.",
        "back": "Back to Homepage"
    },
    "experienceData": {
        "1": {
            "description": "Worked as a Frontend Developer for the project of a big insurance company, Vietnam branch. My team is responsible for developing and maintaining the web application using Angular.",
            "location": "Can Tho, Vietnam",
            "clientLocation": "Vietnam",
            "clientDomain": "Insurance",
            "responsibilities": {
                "1": "Maintained and refactored the codebase",
                "2": "Review the design and develop a new feature based on that design",
                "3": "Participated in the weekly meeting with the account manager to discuss the issues and propose solutions"
            },
            "achievements": {
                "1": "Successfully get acquainted with the job of a web developer.",
                "2": "Successfully help the team to deliver 3 projects on time that meet the customer's requirements.",
                "3": "Successfully accustomed to the Angular framework and some other web technologies such as Bootstrap 4, SwiperJS, etc."
            }
        },
        "2": {
            "description": "Worked as a main Frontend Developer for multiple projects of several client located in Australia. My team is responsible for developing and maintaining the web application using Angular in the frontend and Python in the backend.",
            "location": "Can Tho, Vietnam",
            "clientLocation": "Australia",
            "clientDomain": "Miscellaneous",
            "responsibilities": {
                "1": "Get design mockups, review them, and give feedback to the designer.",
                "2": "From design, build SPA websites with reusable pages and components.",
                "3": "Handle user interactions and integrate APIs from the Backend.",
                "4": "Maintain and support multiple projects.",
                "5": "Participated in the daily meeting with the team and PM to discuss the issues and propose solutions."
            },
            "achievements": {
                "1": "Get acquainted with the knowledge of Scrum - Kanban strategies, and the process of developing a web application.",
                "2": "Significantly improve my communication skills, self-learning skills, and the ability to work under pressure."
            }
        },
        "3": {
            "description": "Worked as a Frontend Developer for multiple projects of several big real estate companies in Singapore. My team is responsible for developing and maintaining the ERP system for clients company using Angular in the frontend and NestJS in the backend.",
            "location": "HCM City, Vietnam",
            "clientLocation": "Singapore",
            "clientDomain": "Real Estate",
            "responsibilities": {
                "1": "Review designs, documents, and technical requirements, and provide feedback to the creator if there are any issues.",
                "2": "Develop UI modules, components, and libraries based on the specifications mentioned in the above documents.",
                "3": "Handle user interactions and integrate APIs from the Backend.",
                "4": "Gather feedback from actual users, discuss it with the team, and propose solutions to any problems.",
                "5": "Communicate with backend colleagues, QC/Testers, and BAs to resolve issues that arise during feature development.",
                "6": "Attend daily meetings with the project manager and CEO to provide updates on work progress, discuss work-related problems, and find solutions.",
                "7": "Utilize Angular and the libraries within the Angular ecosystem to develop CRUD modules, which involve managing user interaction logic and validation of complex and interdependent form clusters (each cluster consists of approximately ten fields).",
                "8": "Employ HTML, SCSS, and TypeScript to create a module system that is user-friendly, mobile responsive, and easily extensible.",
                "9": "Implement the front-end permission system for approximately 100 sub-modules within the project.",
                "10": "Incorporate the Transloco library to implement the translation functionality for the project.",
                "11": "Develop reusable directives, pipes, and UI components to be utilized throughout the project."
            },
            "achievements": {
                "1": "Made <strong>significant progress</strong> in knowledge and skills related to the technologies and frameworks I frequently utilize, particularly <strong>Angular</strong> and <strong>TypeScript</strong>.",
                "2": "Demonstrated <strong>significant improvement</strong> in self-study skills, self-discipline, and ability to work under pressure and in intense environments.",
                "3": "Developed a better vision for work and future plans, and cultivated a more positive attitude when facing challenging problems."
            }
        }
    },
    "seeMore": "See More",
    "achievements": "Achievements",
    "responsibilities": "Responsibilities",
    "projectData": {
        "1": {
            "name": "Portfolio",
            "description": "My personal portfolio website (This site). Built with Angular 14.",
            "mainFunctionality": {
                "1": "Responsive design",
                "2": "Multi-language support",
                "3": "Dark mode support",
                "4": "SEO friendly"
            }
        },
        "2": {
            "name": "Real Estate Agency ERP System",
            "description": "Full scale ERP System for a large real estate agency in Singapore.",
            "mainFunctionality": {
                "1": "Human Resource Management System (Agent Management, Promotion, Recruitment,...)",
                "2": "Transaction Management System (Project Management, Resale Management,...)",
                "3": "Financial Management System (Account Receivable Management, Account Payable Management, Billing Management,...)",
                "4": "Reporting System (Finance Report, Agent Performance Report,...)",
                "5": "Permission Management System (Role Management, User Management,...)",
                "6": "Agent Portal (Agent Dashboard, Agent Profile,...)"
            }
        },
        "3": {
            "name": "Car Workshop Listing Websites",
            "description": "An automobile marketplace website for connecting car owners with workshops for car servicing and repairs in Australia.",
            "mainFunctionality": {
                "1": "Landing Page (Responsive Design, Multi Filtering, SEO)",
                "2": "Provider Portal (Provider Dashboard, Provider Profile)",
                "3": "Admin Portal (Dashboard, Provider Management)"
            }
        },
        "4": {
            "name": "Solar Pool Heating Company Websites",
            "description": "A Product Management System and Landing Page for a Solar Pool Heating Company in Australia.",
            "mainFunctionality": {
                "1": "Landing Page (Responsive Design, Multi Filtering, SEO)",
                "2": "Admin Portal (Dashboard, Product Management)",
                "3": "Trader Portal"
            }
        },
        "5": {
            "name": "Resto. Restaurant Landing Page",
            "description": "A Simple Landing Page for an imaginary Restaurant using HTML, CSS and JavaScript.",
            "mainFunctionality": {
                "1": "Responsive Design"
            }
        }
    },
    "Not Rated": "Not Rated",
    "Small": "Small",
    "Medium": "Medium",
    "Large": "Large",
    "Demo Available": "Demo Available",
    "Personal": "Personal",
    "Team": "Team",
    "Start - End Date": "Start - End Date",
    "Project Category": "Project Category",
    "Project Size": "Project Size",
    "Project Type": "Project Type",
    "Main Functionality": "Main Functionality",
    "Client Location": "Client Location",
    "Client Domain": "Client Domain",
    "Present": "Present",
    "Technologies": "Technologies",
    "Miscellaneous": "Miscellaneous",
    "Automobile": "Automobile",
    "Responsibilities": "Responsibilities",
    "Description": "Description",
    "Team Size": "Team Size",
    "Achievements": "Achievements"
}
