{
    "headline": "Lập Trình Viên Angular",
    "skills": "Kỹ năng",
    "aboutMeSection": "Giới thiệu",
    "experiences": "Kinh nghiệm",
    "projects": "Dự án",
    "contact": {
        "title": "Liên hệ",
        "description": "Cảm ơn bạn đã ghé thăm website của mình. Hiện tại, mình đang có một công việc toàn thời gian tại <a href='https://redoc.co/' target='_blank' rel='noopener noreferrer' class='link-primary'>Redoc.co</a>, nhưng mình luôn đón nhận những cơ hội mới.<br><br>Nếu bạn đang tìm kiếm một thành viên chăm chỉ, chuyên nghiệp và có đam mê, hãy liên hệ với mình. Mình rất mong muốn được tham gia vào các dự án thú vị và hợp tác cùng với các đồng nghiệp tài năng.<br><br>Hãy để lại tin nhắn cho mình với thông tin chi tiết về dự án, cơ hội công việc hoặc mọi thứ bạn muốn mình biết. Mình sẽ phản hồi lại sớm nhất có thể.",
        "address-1": "Quận 8, TPHCM",
        "address-2": "Ninh Kiều, TP. Cần Thơ"
    },
    "contact-form": {
        "name": {
            "label": "Tên",
            "placeholder": "Nhập tên của bạn",
            "required": "Vui lòng nhập tên của bạn"
        },
        "email": {
            "label": "Email",
            "placeholder": "Nhập email của bạn",
            "required": "Vui lòng nhập email của bạn",
            "invalid": "Email không hợp lệ"
        },
        "company": {
            "label": "Công ty",
            "placeholder": "Nhập tên công ty của bạn",
            "required": "Vui lòng nhập tên công ty của bạn"
        },
        "message": {
            "label": "Tin nhắn",
            "placeholder": "Nhập tin nhắn của bạn",
            "required": "Vui lòng nhập tin nhắn của bạn"
        },
        "submit": "Gửi"
    },
    "menu": {
        "about": "Giới thiệu",
        "experience": "Kinh nghiệm",
        "skills": "Kỹ năng",
        "projects": "Dự án",
        "contact": "Liên hệ"
    },
    "credential": {
        "label": {
            "name": "Họ Tên",
            "age": "Tuổi",
            "email": "Email",
            "location": "Nơi làm việc",
            "language": "Ngôn ngữ",
            "education": "Học vấn"
        },
        "value": {
            "name": "Trần Đức Phương",
            "age": "24",
            "email": "tdp99.business@gmail.com",
            "location": "Cần Thơ, TP. HCM",
            "language": "Tiếng Việt, Tiếng Anh",
            "education": "Cử nhân Kỹ thuật (Thủ Khoa Đầu Ra) - Đại học Cần Thơ"
        }
    },
    "yoe": "Năm Kinh Nghiệm",
    "statData": {
        "yoe": "Năm Kinh Nghiệm",
        "projects": "Dự Án Hoàn Thành"
    },
    "contact-info": "Thông Tin Liên Hệ",
    "to-contact-info": "Đến Thông Tin Liên Hệ",
    "skillType": {
        "technical": {
            "label": "Chuyên Môn",
            "angular": {
                "description": "Angular là framework frontend chính mà mình sử dụng, cả trong project của công ty và những project cá nhân. Có thể nói, trong 1.5 năm trở lại đây, hầu như tuần nào mình cũng code Angular, hoặc học về Angular.",
                "subSkills": {
                    "1": "Xây dựng các thành phần cơ bản và có thể tái sử dụng: Components, Directives, Pipes, etc ",
                    "2": "Xử lý Form: Reactive Forms, Template Driven Forms",
                    "3": "Dependency Injection trong thực tế",
                    "4": "Routing & Navigation",
                    "5": "Xử lý HTTP Request (RESTful API) với HttpClient",
                    "6": "Hiểu về cách chia sẻ dữ liệu giữa các Components sử dụng Binding, Service, DI và Store (NgRx)"
                }
            },
            "js": {
                "description": "",
                "subSkills": {
                    "1": "DOM Manipulation",
                    "2": "Interface, Type Alias và Enum",
                    "3": "Sử dụng Generics",
                    "4": "Tạo và Sử dụng Custom Decorators"
                }
            }
        },
        "tool": {
            "label": "Công Cụ Hỗ Trợ"
        },
        "soft": {
            "label": "Kỹ Năng Khác",
            "english": {
                "shortDescription": "TOEIC 970, Giao Tiếp Tốt",
                "description": "Trong hơn 2 năm trở lại đây, mình đã sử dụng tiếng Anh như ngôn ngữ chính trong công việc. Mình có thể giao tiếp tiếng Anh tốt, cả ở viết và nói, và có thể đọc và hiểu tốt các tài liệu tiếng Anh."
            },
            "agile": {
                "shortDescription": "Thành Viên",
                "description": "Mình đã làm việc trong môi trường Agile hơn 2 năm. Mình quen thuộc với Scrum và đã sử dụng nó trong công việc hàng ngày. Mình cũng có hiểu biết về Kanban và đã sử dụng nó trong một số dự án."
            }
        }
    },
    "haveSolidUnderstandingOf": "Có hiểu biết về",
    "certificates": "Chứng chỉ",
    "libraryUsed": "Thư viện sử dụng",
    "sendMessage": "Gửi tin nhắn",
    "resume": "CV",
    "aboutMe": "Xin chào! Mình là Đức Phương, một lập trình viên Front-End chuyên về Angular. Với hơn 2 năm kinh nghiệm làm việc trong lĩnh vực giao diện người dùng, mình rất may mắn đã có cơ hội làm việc tại nhiều công ty và môi trường chuyên nghiệp và năng động ở Cần Thơ và TP Hồ Chí Minh. Với mục tiêu chính của mình khi đến với nghề này là đóng góp vào việc tạo ra sản phẩm có giá trị thực sự cho người dùng, mình luôn không ngừng nâng cao kỹ năng và mong muốn học hỏi từ những người giỏi nhất. Nếu bạn đang tìm kiếm một lập trình viên Front-End có đam mê và cam kết đem lại giá trị cho dự án của bạn, hãy liên hệ với mình ngay bây giờ. Mình rất mong muốn có cơ hội hợp tác và góp phần vào sự thành công của bạn.",
    "p404": {
        "title": "Ooops... 404!",
        "description": "Trang bạn yêu cầu không thể tìm thấy.",
        "back": "Trở về Trang Chủ"
    },
    "experienceData": {
        "1": {
            "description": "Làm việc như một lập trình viên Front-End cho dự án của một công ty bảo hiểm lớn, chi nhánh Việt Nam. Team chịu trách nhiệm phát triển và bảo trì ứng dụng web sử dụng Angular.",
            "location": "Cần Thơ, TP. HCM",
            "clientLocation": "Việt Nam",
            "clientDomain": "Bảo Hiểm",
            "responsibilities": {
                "1": "Bảo trì và tối ưu codebase",
                "2": "Đánh giá thiết kế và phát triển tính năng mới dựa trên thiết kế đó",
                "3": "Tham gia vào họp hàng tuần với account manager để thảo luận về các vấn đề và đề xuất giải pháp"
            },
            "achievements": {
                "1": "Thành công trong việc làm quen với công việc của một lập trình viên web.",
                "2": "Thành công trong việc giúp đội hoàn thành 3 dự án đúng tiến độ và đáp ứng được yêu cầu của khách hàng.",
                "3": "Thành công trong việc làm quen với framework Angular và một số công nghệ web khác như Bootstrap 4, RxJS, etc."
            }
        },
        "2": {
            "description": "Làm việc như một lập trình viên Front-End chính cho nhiều dự án của nhiều khách hàng tại Úc. Team chịu trách nhiệm phát triển và bảo trì ứng dụng web sử dụng Angular ở phía Front-End và Python ở phía Back-End.",
            "location": "Cần Thơ, Việt Nam",
            "clientLocation": "Úc",
            "clientDomain": "Nhiều Lĩnh Vực",
            "responsibilities": {
                "1": "Nhận thiết kế từ designer, review và đưa ra feedback cho designer.",
                "2": "Từ thiết kế, xây dựng các trang web sử dụng Angular.",
                "3": "Xử lý tương tác từ người dùng và tích hợp API từ Back-End.",
                "4": "Bảo trì và hỗ trợ nhiều dự án cùng lúc.",
                "5": "Tham gia họp hàng ngày với team và PM để thảo luận về các vấn đề và đề xuất giải pháp."
            },
            "achievements": {
                "1": "Làm quen với các kiến thức về Scrum - Kanban và quy trình phát triển ứng dụng web",
                "2": "Cải thiện đáng kể kỹ năng giao tiếp, kỹ năng tự học và khả năng làm việc dưới áp lực."
            }
        },
        "3": {
            "description": "Làm việc như một lập trình viên Front-End cho nhiều dự án của khách hàng tại Singapore. Team chịu trách nhiệm phát triển và bảo trì ứng dụng web sử dụng Angular ở phía Front-End và NestJS ở phía Back-End.",
            "location": "TP. HCM, Việt Nam",
            "clientLocation": "Singapore",
            "clientDomain": "Bất Động Sản",
            "responsibilities": {
                "1": "Xem xét design, tài liệu và yêu cầu kỹ thuật, đồng thời cung cấp phản hồi cho designer, BA nếu có bất kỳ vấn đề nào ",
                "2": "Phát triển các module, component và thư viện UI dựa trên các yêu cầu được đề cập trong tài liệu trên",
                "3": "Xử lý tương tác từ người dùng và tích hợp API từ Back-End.",
                "4": "Thu thập phản hồi từ người dùng thực tế, thảo luận với nhóm và đề xuất giải pháp cho vấn đề",
                "5": "Tham gia họp hàng ngày với team và PM để thảo luận về các vấn đề và đề xuất giải pháp.",
                "6": "Giao tiếp với các đồng nghiệp BE, QC/Tester và BA để giải quyết các vấn đề phát sinh trong quá trình phát triển tính năng",
                "7": "Sử dụng Angular và các thư viện trong hệ sinh thái Angular để phát triển các mô-đun CRUD, liên quan đến việc quản lý logic tương tác của người dùng và xác thực các cụm biểu mẫu phức tạp và phụ thuộc lẫn nhau (mỗi cụm bao gồm khoảng mười trường).",
                "8": "Sử dụng HTML, SCSS và TypeScript để tạo một hệ thống mô-đun thân thiện với người dùng, phản hồi trên thiết bị di động và dễ dàng mở rộng",
                "9": "Triển khai hệ thống cấp phép giao diện người dùng cho khoảng 100 mô-đun phụ trong dự án.",
                "10": "Kết hợp thư viện Transloco để triển khai chức năng dịch thuật cho dự án.",
                "11": "Phát triển các chỉ thị, đường dẫn và các thành phần giao diện người dùng có thể tái sử dụng để sử dụng trong suốt dự án."
            },
            "achievements": {
                "1": "Đã <strong>tiến bộ đáng kể</strong> về kiến thức và kỹ năng liên quan đến các công nghệ và khuôn khổ mà tôi thường sử dụng, đặc biệt là <strong>Angular</strong> và <strong>TypeScript</strong>.",
                "2": "Đã thể hiện <strong>sự cải thiện đáng kể</strong> về kỹ năng tự học, kỷ luật tự giác và khả năng làm việc dưới áp lực và môi trường khắc nghiệt.",
                "3": "Phát triển tầm nhìn tốt hơn cho công việc và kế hoạch tương lai, đồng thời trau dồi thái độ tích cực hơn khi đối mặt với những vấn đề khó khăn."
            }
        }
    },
    "seeMore": "Xem thêm",
    "achievements": "Thành Tựu",
    "responsibilities": "Trách Nhiệm"
}
