{
    "headline": "Lập Trình Viên Angular",
    "skills": "Kỹ năng",
    "aboutMeSection": "Giới thiệu",
    "experiences": "Kinh nghiệm",
    "projects": "Dự án",
    "contact": {
        "title": "Liên hệ",
        "description": "Cảm ơn bạn đã ghé thăm website của mình. Hiện tại, mình đang có một công việc toàn thời gian tại <a href='https://redoc.co/' target='_blank' rel='noopener noreferrer' class='primary-link'>Redoc.co</a>, nhưng mình luôn đón nhận những cơ hội mới.<br><br>Nếu bạn đang tìm kiếm một thành viên chăm chỉ, chuyên nghiệp và có đam mê, hãy liên hệ với mình. Mình rất mong muốn được tham gia vào các dự án thú vị và hợp tác cùng với các đồng nghiệp tài năng.<br><br>Hãy để lại tin nhắn cho mình với thông tin chi tiết về dự án, cơ hội công việc hoặc mọi thứ bạn muốn mình biết. Mình sẽ phản hồi lại sớm nhất có thể.",
        "address-1": "Quận 8, TPHCM",
        "address-2": "Ninh Kiều, TP. Cần Thơ"
    },
    "contact-form": {
        "name": {
            "label": "Tên",
            "placeholder": "Nhập tên của bạn",
            "required": "Vui lòng nhập tên của bạn"
        },
        "email": {
            "label": "Email",
            "placeholder": "Nhập email của bạn",
            "required": "Vui lòng nhập email của bạn",
            "invalid": "Email không hợp lệ"
        },
        "company": {
            "label": "Công ty",
            "placeholder": "Nhập tên công ty của bạn",
            "required": "Vui lòng nhập tên công ty của bạn"
        },
        "message": {
            "label": "Tin nhắn",
            "placeholder": "Nhập tin nhắn của bạn",
            "required": "Vui lòng nhập tin nhắn của bạn"
        },
        "submit": "Gửi"
    },
    "menu": {
        "about": "Giới thiệu",
        "experience": "Kinh nghiệm",
        "skills": "Kỹ năng",
        "projects": "Dự án",
        "contact": "Liên hệ"
    },
    "credential": {
        "label": {
            "name": "Họ Tên",
            "age": "Tuổi",
            "email": "Email",
            "location": "Nơi làm việc",
            "language": "Ngôn ngữ",
            "education": "Học vấn"
        },
        "value": {
            "name": "Trần Đức Phương",
            "age": "24",
            "email": "tdp99.business@gmail.com",
            "location": "Cần Thơ, TP. HCM",
            "language": "Tiếng Việt, Tiếng Anh",
            "education": "Cử nhân Kỹ thuật (Thủ Khoa Đầu Ra) - Đại học Cần Thơ"
        }
    },
    "yoe": "Năm Kinh Nghiệm",
    "statData": {
        "yoe": "Năm Kinh Nghiệm",
        "projects": "Dự Án Hoàn Thành"
    },
    "contact-info": "Thông Tin Liên Hệ",
    "to-contact-info": "Đến Thông Tin Liên Hệ",
    "skillType": {
        "technical": {
            "label": "Chuyên Môn",
            "angular": {
                "description": "Angular là framework frontend chính mà mình sử dụng, cả trong project của công ty và những project cá nhân. Có thể nói, trong 1.5 năm trở lại đây, hầu như tuần nào mình cũng code Angular, hoặc học về Angular.",
                "subSkills": {
                    "1": "Xây dựng các thành phần cơ bản và có thể tái sử dụng: Components, Directives, Pipes, etc ",
                    "2": "Xử lý Form: Reactive Forms, Template Driven Forms",
                    "3": "Dependency Injection trong thực tế",
                    "4": "Routing & Navigation",
                    "5": "Xử lý HTTP Request (RESTful API) với HttpClient",
                    "6": "Hiểu về cách chia sẻ dữ liệu giữa các Components sử dụng Binding, Service, DI và Store (NgRx)"
                }
            },
            "js": {
                "description": "",
                "subSkills": {
                    "1": "DOM Manipulation",
                    "2": "Interface, Type Alias và Enum",
                    "3": "Sử dụng Generics",
                    "4": "Tạo và Sử dụng Custom Decorators"
                }
            }
        },
        "tool": {
            "label": "Công Cụ Hỗ Trợ"
        },
        "soft": {
            "label": "Kỹ Năng Khác",
            "english": {
                "shortDescription": "TOEIC 970, Giao Tiếp Tốt",
                "description": "Trong hơn 2 năm trở lại đây, mình đã sử dụng tiếng Anh như ngôn ngữ chính trong công việc. Mình có thể giao tiếp tiếng Anh tốt, cả ở viết và nói, và có thể đọc và hiểu tốt các tài liệu tiếng Anh."
            },
            "agile": {
                "shortDescription": "Thành Viên",
                "description": "Mình đã làm việc trong môi trường Agile hơn 2 năm. Mình quen thuộc với Scrum và đã sử dụng nó trong công việc hàng ngày. Mình cũng có hiểu biết về Kanban và đã sử dụng nó trong một số dự án."
            }
        }
    },
    "haveSolidUnderstandingOf": "Có hiểu biết về",
    "certificates": "Chứng chỉ",
    "libraryUsed": "Thư viện sử dụng",
    "sendMessage": "Gửi tin nhắn",
    "resume": "CV",
    "aboutMe": "Xin chào! Mình là Đức Phương, một lập trình viên Front-End Angular. <br> Với hơn 2 năm kinh nghiệm làm một Front-End Dev, mình may mắn có cơ hội làm việc tại nhiều công ty, môi trường chuyên nghiệp và năng động ở Cần Thơ và TPHCM. <br> Mong muốn góp phần tạo ra sản phẩm có giá trị, mình không ngừng tự học và khao khát học từ những người giỏi nhất. Nếu bạn đang tìm kiếm một lập trình viên Front-End có đam mê, cam kết đem lại giá trị cho dự án, hãy liên hệ với mình. Mình rất mong muốn có cơ hội hợp tác và góp phần vào sự thành công chung của chúng ta.",
    "p404": {
        "title": "Ooops... 404!",
        "description": "Trang bạn yêu cầu không thể tìm thấy.",
        "back": "Trở về Trang Chủ"
    },
    "experienceData": {
        "1": {
            "description": "Thực tập sinh và lập trình viên Front-End bán thời gian cho dự án của một công ty bảo hiểm lớn, chi nhánh Việt Nam. Team chịu trách nhiệm phát triển và bảo trì ứng dụng web sử dụng Angular, Nx.",
            "location": "Cần Thơ, TP. HCM",
            "clientLocation": "Việt Nam",
            "clientDomain": "Bảo Hiểm",
            "responsibilities": {
                "1": "Bảo trì và tối ưu codebase",
                "2": "Đánh giá thiết kế và phát triển tính năng mới dựa trên thiết kế",
                "3": "Tham gia vào họp hàng tuần với account manager để thảo luận về các vấn đề và đề xuất giải pháp"
            },
            "achievements": {
                "1": "Làm quen với công việc của một lập trình viên web.",
                "2": "Góp sức với team hoàn thành đúng tiến độ 3 dự án, đáp ứng được yêu cầu của khách hàng.",
                "3": "Quen với framework Angular và một số library khác như Bootstrap 4, RxJS, etc."
            }
        },
        "2": {
            "description": "Lập trình viên Front-End chính trong nhiều dự án với khách hàng Úc. Team chịu trách nhiệm phát triển, bảo trì ứng dụng web sử dụng Angular phía Front-End và Python phía Back-End.",
            "location": "Cần Thơ, Việt Nam",
            "clientLocation": "Úc",
            "clientDomain": "Nhiều Lĩnh Vực",
            "responsibilities": {
                "1": "Nhận thiết kế từ designer, review và đưa ra feedback cho designer.",
                "2": "Từ thiết kế, xây dựng web sử dụng Angular.",
                "3": "Xử lý tương tác từ người dùng và tích hợp API từ Back-End.",
                "4": "Bảo trì và hỗ trợ nhiều dự án cùng lúc.",
                "5": "Tham gia họp hàng ngày với team và PM để thảo luận về các vấn đề và đề xuất giải pháp."
            },
            "achievements": {
                "1": "Làm quen với các kiến thức về Scrum - Kanban và quy trình phát triển ứng dụng web",
                "2": "Cải thiện đáng kể kỹ năng giao tiếp, kỹ năng tự học và khả năng làm việc dưới áp lực."
            }
        },
        "3": {
            "description": "Lập trình viên Front-End chính trong nhiều dự án với khách hàng Singapore. Team chịu trách nhiệm phát triển, bảo trì ứng dụng web sử dụng Angular phía Front-End và NestJS phía Back-End.",
            "location": "TP. HCM, Việt Nam",
            "clientLocation": "Singapore",
            "clientDomain": "Bất Động Sản",
            "responsibilities": {
                "1": "Xem xét design, tài liệu và yêu cầu kỹ thuật, phản hồi cho designer, BA nếu có vấn đề",
                "2": "Phát triển các module feature, xử lý các cụm form phức tạp và tích hợp API từ Back-End.",
                "3": "Viết các directive, pipe, UI library có thể tái sử dụng trong suốt dự án.",
                "4": "Triển khai hệ thống permission cho khoảng 100 module phụ trong dự án.",
                "5": "Sử dụng thư viện Transloco để triển khai chức năng đa ngôn ngữ cho dự án.",
                "6": "Tham gia họp hàng ngày với team và PM, cũng như thảo luận riêng với BE, BA, QC, Tester về các vấn đề và đề xuất giải pháp."
            },
            "achievements": {
                "1": "Tiến bộ đáng kể về kiến thức và kỹ năng liên quan đến các công nghệ thường sử dụng, đặc biệt là Angular và TypeScript.",
                "2": "Cải thiện đáng kể kỹ năng tự học, kỷ luật và khả năng làm việc dưới áp lực.",
                "3": "Phát triển tầm nhìn tốt hơn trong công việc và kế hoạch tương lai, đồng thời rèn luyện thái độ tích cực hơn khi đối mặt với những vấn đề khó khăn."
            }
        }
    },
    "seeMore": "Xem thêm",
    "achievements": "Thành Tựu",
    "responsibilities": "Trách Nhiệm",
    "projectData": {
        "1": {
            "name": "Portfolio",
            "description": "Trang web cá nhân của mình. Được xây dựng với Angular 14.",
            "mainFunctionality": {
                "1": "Responsive design",
                "2": "Hỗ trợ đa ngôn ngữ",
                "3": "Dark mode",
                "4": "Tối ưu SEO"
            }
        },
        "2": {
            "name": "Hệ Thống ERP Công Ty Bất Động Sản",
            "description": "Hệ thống ERP toàn diện cho một công ty bất động sản lớn tại Singapore.",
            "mainFunctionality": {
                "1": "Agent Mananger - Quản Lý Nhân Sự",
                "2": "Transactions - Quản Lý Giao Dịch",
                "3": "Finances - Quản Lý Tài Chính",
                "4": "Reports - Báo Cáo (Báo Cáo Tài Chính, Báo Cáo Hiệu Suất Đại Lý,...)",
                "5": "Phân Quyền",
                "6": "Agent Portal"
            }
        },
        "3": {
            "name": "Website Kết Nối Đại Lý Dịch Vụ Và Người Dùng Ô Tô",
            "description": "Trang web thương mại điện tử cho phép đại lý đăng ký dịch vụ liên quan đến chăm sóc ô tô và cho phép người dùng tìm kiếm các dịch vụ ô tô gần nhất.",
            "mainFunctionality": {
                "1": "Landing Page (Responsive Design, SEO)",
                "2": "User Portal",
                "3": "Admin Portal"
            }
        },
        "4": {
            "name": "Website Công Ty Sản Xuất Sưởi Hồ Bơi Bằng Năng Lượng Mặt Trời",
            "description": "Hệ thống quản lý sản phẩm và trang đích cho một công ty sản xuất thiết bị sưởi ấm hồ bơi năng lượng mặt trời ở Úc.",
            "mainFunctionality": {
                "1": "Landing Page (Responsive Design, SEO)",
                "2": "User Portal",
                "3": "Admin Portal"
            }
        },
        "5": {
            "name": "Trang Web Nhà Hàng",
            "description": "Trang web giới thiệu cho một nhà hàng ảo sử dụng HTML, CSS và JavaScript.",
            "mainFunctionality": {
                "1": "Responsive Design"
            }
        }
    },
    "Not Rated": "Không Đánh Giá",
    "Small": "Nhỏ",
    "Medium": "Trung Bình",
    "Large": "Lớn",
    "Demo Available": "Có Demo",
    "Personal": "Cá Nhân",
    "Team": "Nhóm / Công Ty",
    "Start - End Date": "Thời Gian Thực Hiện",
    "Project Category": "Phân Loại Dự Án",
    "Project Size": "Quy Mô Dự Án",
    "Project Type": "Loại Dự Án",
    "Main Functionality": "Chức Năng Chính",
    "Client Location": "Khách Hàng",
    "Client Domain": "Lĩnh Vực",
    "Technologies": "Công Nghệ",
    "Present": "Hiện Tại",
    "Miscellaneous": "Khác",
    "Automobile": "Ô Tô",
    "Responsibilities": "Trách Nhiệm",
    "Description": "Mô Tả",
    "Team Size": "Quy Mô Nhóm",
    "Achievements": "Thành Tựu",
    "projectSizeTooltip": "Theo <a href='https://uwaterloo.ca/ist-project-management-office/methodologies/project-sizing-and-complexity' target='_blank' rel='noopener noreferrer'>Project sizing and complexity</a>"
}
